/*
در کد زیر ما با استفاده از 
* 
بعد از نوع متغیر که اینجا
int 
هست 
و بعد نام 
متغیر که 
clone 
و برای مقدار متغیر به این صورت
&age
گفتیم یک متغیر پوینتر داریم که اشاره میکنه به جایگاه متغیر 
age 
در حافظه . مقدار متغیر 
age 
رو بعد از چاپ گرفتن 
clone 
خواهیم داشت . 
زیرا از متغیر 
age 
در متغیر 
clone 
کپی گرفتیم . 
برای استفاده هم به این صورت
*clone 
تا بفهمونیم این متغیر ما یک پوینتر هستش



  */


#include <iostream>



int main(){
    int age = 20;
    int* clone = &age;



    std::cout << "Hello World " << *clone;
}
