// متغیر ها در این زبان برنامه نویسی نیاز به تعریف نوع دارند برای مثال
int age = 33;
// متغیر هایی که تعریف میشوند حتما باید مقدار دهی شوند . در غیر این صورت باعث به وجود آمدن ارور خواهد شد
// این زبان به بزرگی و کوچکی حروف حساس است و موارد مشابه تعریف شده اگر با حروف با اندازه متفاوت باشند کاملا از هم متفاوت خواهند بود



//==============================================================

// تعریف ثابت ها در این زبان برنامه نویسی به این صورت انجام میپذیرد : 

const int age = 33;

// همانطور که میدانید این مورد به این معناست که دیگر در هیچ کجای برنامه این مقدار متغیر قابل تغییر نخواهد بود


// =============================================================
